Resources/mockup/Movement/report.yaml


-
    SOURCE_ID: 213731559420
    USER_ID: 545454545
    TRANSACTION_TYPE: income
    DETAIL: payment
    SETTLEMENT_NET_AMOUNT: 343.9
    SETTLEMENT_CURRENCY: BRL
    REFERENCE_ID: 7231125046
    SITE_ID: MLB
    CLIENT_ID: 0
    PAYMENT_METHOD_TYPE: other
    STATUS: available
    LABEL: bacen_available
    TRANSACTION_DATE: '2016-12-12T06:46:29.000-04:00'
    SETTLEMENT_DATE: '2016-12-24T14:55:00.000-04:00'
    BALANCED_AMOUNT: 218818.63
    ORIGINAL_MOVE_ID: null
    DATE_IN_MILLIS: 21513075589766
-
    SOURCE_ID: 212914859670
    USER_ID: 545454545
    TRANSACTION_TYPE: income
    DETAIL: payment
    SETTLEMENT_NET_AMOUNT: 2229.7
    SETTLEMENT_CURRENCY: BRL
    REFERENCE_ID: 2919565251
    SITE_ID: MLB
    CLIENT_ID: 0
    PAYMENT_METHOD_TYPE: credit_card
    STATUS: available
    LABEL: bacen_available
    TRANSACTION_DATE: '2016-08-14T18:55:25.000-04:00'
    SETTLEMENT_DATE: '2016-08-18T14:34:02.000-04:00'
    BALANCED_AMOUNT: 74456.43
    ORIGINAL_MOVE_ID: null
    DATE_IN_MILLIS: 21502751325545
-
    SOURCE_ID: 212897466270
    USER_ID: 545454545
    TRANSACTION_TYPE: income
    DETAIL: payment
    SETTLEMENT_NET_AMOUNT: 253.9
    SETTLEMENT_CURRENCY: BRL
    REFERENCE_ID: 2915464037
    SITE_ID: MLB
    CLIENT_ID: 0
    PAYMENT_METHOD_TYPE: credit_card
    STATUS: available
    LABEL: bacen_available
    TRANSACTION_DATE: '2016-08-12T11:09:42.000-04:00'
    SETTLEMENT_DATE: '2016-08-24T12:02:24.000-04:00'
    BALANCED_AMOUNT: 73296.71
    ORIGINAL_MOVE_ID: null
    DATE_IN_MILLIS: 21502550582893
-
    SOURCE_ID: 212694927160
    USER_ID: 545454545
    TRANSACTION_TYPE: income
    DETAIL: payment
    SETTLEMENT_NET_AMOUNT: 2278.9
    SETTLEMENT_CURRENCY: BRL
    REFERENCE_ID: 2868809965
    SITE_ID: MLB
    CLIENT_ID: 0
    PAYMENT_METHOD_TYPE: credit_card
    STATUS: available
    LABEL: bacen_available
    TRANSACTION_DATE: '2016-07-21T17:39:35.000-04:00'
    SETTLEMENT_DATE: '2016-08-04T10:07:29.000-04:00'
    BALANCED_AMOUNT: 219798.42
    ORIGINAL_MOVE_ID: null
    DATE_IN_MILLIS: 21500673175459
-
    SOURCE_ID: 8411703031
    USER_ID: 545454545
    TRANSACTION_TYPE: income
    DETAIL: payment
    SETTLEMENT_NET_AMOUNT: 2325
    SETTLEMENT_CURRENCY: BRL
    REFERENCE_ID: 7194201614
    SITE_ID: MLB
    CLIENT_ID: 0
    PAYMENT_METHOD_TYPE: other
    STATUS: available
    LABEL: bacen_available
    TRANSACTION_DATE: '2016-11-28T17:46:11.000-04:00'
    SETTLEMENT_DATE: '2016-12-17T15:00:11.000-04:00'
    BALANCED_AMOUNT: 78891.71
    ORIGINAL_MOVE_ID: null
    DATE_IN_MILLIS: 21511905571743
-
    SOURCE_ID: 213592321850
    USER_ID: 545454545
    TRANSACTION_TYPE: income
    DETAIL: payment
    SETTLEMENT_NET_AMOUNT: 2381.9
    SETTLEMENT_CURRENCY: BRL
    REFERENCE_ID: 7139331126
    SITE_ID: MLB
    CLIENT_ID: 0
    PAYMENT_METHOD_TYPE: credit_card
    STATUS: available
    LABEL: bacen_available
    TRANSACTION_DATE: '2016-11-12T16:24:33.000-04:00'
    SETTLEMENT_DATE: '2016-11-21T19:05:17.000-04:00'
    BALANCED_AMOUNT: 60074.56
    ORIGINAL_MOVE_ID: null
    DATE_IN_MILLIS: 21510518273328
-
    SOURCE_ID: 212608777640
    USER_ID: 545454545
    TRANSACTION_TYPE: income
    DETAIL: payment
    SETTLEMENT_NET_AMOUNT: 536.9
    SETTLEMENT_CURRENCY: BRL
    REFERENCE_ID: 2848915496
    SITE_ID: MLB
    CLIENT_ID: 0
    PAYMENT_METHOD_TYPE: credit_card
    STATUS: available
    LABEL: bacen_available
    TRANSACTION_DATE: '2016-07-12T12:34:22.000-04:00'
    SETTLEMENT_DATE: '2016-07-28T11:45:00.000-04:00'
    BALANCED_AMOUNT: 210983.19
    ORIGINAL_MOVE_ID: null
    DATE_IN_MILLIS: 21499877262964
-
    SOURCE_ID: 212608428540
    USER_ID: 545454545
    TRANSACTION_TYPE: income
    DETAIL: payment
    SETTLEMENT_NET_AMOUNT: 2352.8
    SETTLEMENT_CURRENCY: BRL
    REFERENCE_ID: 2849200306
    SITE_ID: MLB
    CLIENT_ID: 0
    PAYMENT_METHOD_TYPE: credit_card
    STATUS: available
    LABEL: bacen_available
    TRANSACTION_DATE: '2016-07-12T11:48:59.000-04:00'
    SETTLEMENT_DATE: '2016-07-16T16:54:01.000-04:00'
    BALANCED_AMOUNT: 210807.61
    ORIGINAL_MOVE_ID: null
    DATE_IN_MILLIS: 21499874539784
-
    SOURCE_ID: 212612769380
    USER_ID: 545454545
    TRANSACTION_TYPE: income
    DETAIL: payment
    SETTLEMENT_NET_AMOUNT: 763.8
    SETTLEMENT_CURRENCY: BRL
    REFERENCE_ID: 2849872080
    SITE_ID: MLB
    CLIENT_ID: 0
    PAYMENT_METHOD_TYPE: credit_card
    STATUS: available
    LABEL: bacen_available
    TRANSACTION_DATE: '2016-07-12T16:58:00.000-04:00'
    SETTLEMENT_DATE: '2016-07-21T17:58:16.000-04:00'
    BALANCED_AMOUNT: 211799.93
    ORIGINAL_MOVE_ID: null
    DATE_IN_MILLIS: 21499893080119
-
    SOURCE_ID: 212387435690
    USER_ID: 545454545
    TRANSACTION_TYPE: income
    DETAIL: payment
    SETTLEMENT_NET_AMOUNT: 2030.9
    SETTLEMENT_CURRENCY: BRL
    REFERENCE_ID: 2797522270
    SITE_ID: MLB
    CLIENT_ID: 0
    PAYMENT_METHOD_TYPE: credit_card
    STATUS: available
    LABEL: bacen_available
    TRANSACTION_DATE: '2016-06-16T15:55:41.000-04:00'
    SETTLEMENT_DATE: '2016-06-29T12:42:00.000-04:00'
    BALANCED_AMOUNT: 5202.29
    ORIGINAL_MOVE_ID: null
    DATE_IN_MILLIS: 21497642941568
